; domain
(define (domain crash-d)
    (:requirements :adl)

    (:types
        car lane altitude direction - object
    )

    (:constants
        agent - car
        left straight right - direction
    )

    (:predicates
        (equal ?C1 - car ?C2 - car)
        (hasPos ?C - car ?L - lane ?A - altitude)
        (hasDir ?C - car ?D - direction)
        (nextX ?D - direction ?L1 - lane ?L2 - lane)
        (nextY ?A1 - altitude ?A2 - altitude)
        (hasCrashed ?C1 - car)
        (hasBumped ?C1 - car)
        (updated)
    )

    (:action setDirection
        :parameters (?D1 - direction)
        :precondition (updated)
        :effect (and
            (not (hasDir agent left))
            (not (hasDir agent straight))
            (not (hasDir agent right))
            (hasDir agent ?D1))
    )

    (:action setStop
        :parameters ()
        :precondition (updated)
        :effect (and
            (not (hasDir agent left))
            (not (hasDir agent straight))
            (not (hasDir agent right)))
    )

    (:action update
        :parameters ()
        :precondition (not (updated))
        :effect (and
            (updated)
            (forall
                (?C1 - car ?C2 - car ?A1 - altitude ?L1 - lane)
                (when
                    (and
                        (not (equal ?C1 ?C2))
                        (not (equal ?C1 agent))
                        (not (equal ?C2 agent))
                        (not (hasCrashed ?C1))
                        (hasPos ?C1 ?L1 ?A1)
                        (hasPos ?C2 ?L1 ?A1))
                    (and
                        (hasCrashed ?C1)
                        (hasCrashed ?C2)
                    )))
            (forall
                (?C1 - car ?A1 - altitude ?L1 - lane)
                (when
                    (and
                        (not (equal ?C1 agent))
                        (hasPos agent ?L1 ?A1)
                        (hasPos ?C1 ?L1 ?A1))
                    (and
                        (hasBumped agent)
                        (hasBumped ?C1)
                    ))))
    )

    (:action go
        :parameters ()
        :precondition (updated)
        :effect (and
            (not (updated))
            (forall
                (?C1 - car ?D1 - direction ?A1 - altitude ?A2 - altitude ?L1 - lane ?L2 - lane)
                (when
                    (and
                        (not (hasCrashed ?C1))
                        (hasPos ?C1 ?L1 ?A1)
                        (hasDir ?C1 ?D1)
                        (nextX ?D1 ?L1 ?L2)
                        (nextY ?A1 ?A2))
                    (and
                        (not (hasPos ?C1 ?L1 ?A1))
                        (hasPos ?C1 ?L2 ?A2))))
        )
    )
)

; problem
(define (problem crash-p-01)
    (:domain crash-d)
    (:objects
        c1 c2 - car
        l1 l2 l3 - lane
        a1 a2 a3 a4 a5 - altitude
    )
    (:init
        (updated)

        (equal agent agent)
        (equal c1 c1)
        (equal c2 c2)

        (hasPos agent l3 a1)
        (hasPos c1 l1 a1)
        (hasPos c2 l2 a1)

        (hasDir agent straight)
        (hasDir c1 right)
        (hasDir c2 right)

        (nextX straight l1 l1)
        (nextX straight l2 l2)
        (nextX straight l3 l3)
        (nextX right l1 l2)
        (nextX right l2 l3)
        (nextX right l3 l3)
        (nextX left l1 l1)
        (nextX left l2 l1)
        (nextX left l3 l2)

        (nextY a1 a2)
        (nextY a2 a3)
        (nextY a3 a4)
        (nextY a4 a5)
        (nextY a5 a5)
    )

    (:goal
        (and (hasPos agent l3 a5)
            (not (hasCrashed agent)))
    )
)

; plan
1. (go)
   deleted: (updated) (haspos agent l3 a1) (haspos c1 l1 a1) (haspos c2 l2 a1)
   added: (haspos agent l3 a2) (haspos c1 l2 a2) (haspos c2 l3 a2)
   goals met: 1 of 2
2. (update)
   added: (updated) (hasbumped agent) (hasbumped c2)
   goals met: 1 of 2
3. (go)
   deleted: (updated) (haspos agent l3 a2) (haspos c1 l2 a2) (haspos c2 l3 a2)
   added: (haspos agent l3 a3) (haspos c1 l3 a3) (haspos c2 l3 a3)
   goals met: 1 of 2
4. (update)
   added: (updated) (hascrashed c1) (hascrashed c2) (hasbumped c1)
   goals met: 1 of 2
5. (go)
   deleted: (updated) (haspos agent l3 a3)
   added: (haspos agent l3 a4)
   goals met: 1 of 2
6. (update)
   added: (updated)
   goals met: 1 of 2
7. (go)
   deleted: (updated) (haspos agent l3 a4)
   added: (haspos agent l3 a5)
   goals met: 2 of 2
